In [15]:
import pandas as pd

In [16]:
titanic = pd.read_excel('http://biostat.mc.vanderbilt.edu/wiki/pub/Main/DataSets/titanic3.xls')

In [17]:
titanic['first_name'] = titanic['name'].str.split(', ').str.get(1).str.split('.').str.get(1).str.split("Jr").str.get(0).str.split ()

In [18]:
titanic['first_names_count'] = titanic['first_name'].str.len ()
titanic [titanic['first_names_count'] == 1].head (5)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,first_name,first_names_count
5,1,1,"Anderson, Mr. Harry",male,48.0,0,0,19952,26.5500,E12,S,3,NaN,"New York, NY",[Harry],1
7,1,0,"Andrews, Mr. Thomas Jr",male,39.0,0,0,112050,0.0000,A36,S,NaN,NaN,"Belfast, NI",[Thomas],1
9,1,0,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C,NaN,22.0,"Montevideo, Uruguay",[Ramon],1
18,1,1,"Bazzani, Miss. Albina",female,32.0,0,0,11813,76.2917,D15,C,8,NaN,NaN,[Albina],1
19,1,0,"Beattie, Mr. Thomson",male,36.0,0,0,13050,75.2417,C6,C,A,NaN,"Winnipeg, MN",[Thomson],1

In [19]:
len (titanic [titanic['first_names_count'] == 1])

469

NameError: name 'go' is not defined

In [20]:
#2.část

In [21]:
titanic['boat'] = titanic['boat'].str.split (" ").str.get(0)

In [22]:
titanic_boat = titanic.groupby(["boat"]).sum ()
titanic_boat.head (5)

,pclass,survived,age,sibsp,parch,fare,body,first_names_count
boat,,,,,,,,
1,5,5,181.0000,3,0,234.9001,NaN,16
10,56,29,701.0834,25,28,1802.4917,NaN,82
11,49,25,530.7500,12,13,941.2208,NaN,70
12,40,18,507.5000,9,8,374.0874,NaN,41
13,112,42,803.8333,10,12,652.3665,NaN,80

In [23]:
titanic_boat["survived"].argmax ()

'13'

In [24]:
#Nebo alternativně takto, bez užití "survived"

In [25]:
titanic['number'] = 1
titanic_boat2 = titanic.groupby(["boat"]).sum ()
titanic_boat2["survived"].argmax ()

'13'